{
    "projects": [
        {
            "title": "rumi",
            "key": 5,
            "time": "August 2025 - Present",
            "description": "Currently developing a roommate finder app in Swift. Built to help university students find housing more easily. Backend database is Firebase, while also using Firebase authentication. ",
            "link": "",
            "linktype": "",
            "tags": [
                "Swift",
                "SwiftUI",
                "Firebase Firestore"
            ]
        },
        {
            "title": "cardmatch",
            "key": 4,
            "time": "January 2026",
            "description": "Completed as a submission for nwPlus' nwHacks 2026, cardmatch is a financial site dedicated to helping users find the credit card that best suits their needs. By inputting statements and answering a short questionnaire, the user is shown potential card matches while also seeing their spending broken down into categories. I focused on frontend development.",
            "link": "https://www.youtube.com/watch?si=PlSn5jjZcYoNg7yu&v=mbr0nw3EORE&feature=youtu.be",
            "linktype": "Youtube demo",
            "tags": [
                "Hackathon",
                "Typescript",
                "Next.js",
                "Openrouter",
                "Zod",
                "Tailwind"
            ]
        },
        {
            "title": "aidYVR",
            "key": 3,
            "time": "November 2025 - December 2025",
            "description": "Developed a website that allows philanthropic organizations to make volunteer position postings. Organizations can enter job location and information. Users can allow the site to view their location and sort positions by different categories. Used Google Maps API to plot positions and Geolocation to attain coordinates from addresses.",
            "link": "https://github.com/henovw/aidYVR",
            "linktype": "GitHub repository",
            "tags": [
                "Javascript",
                "React",
                "PostgreSQL",
                "Node.js",
                "Google Geolocation API",
                "Google Maps API"
            ]
        },
        {
            "title": "NeighborGood",
            "key": 2,
            "time": "November 2025",
            "description": "Completed as a submission for nwPlus' HackCamp 2025, NeighborGood is a site dedicated to helping philanthropic organizations by letting organizations make postings of the donations they need. Users can enter the site, sort by the items they can donate, and easily see which organizations are in need of their donations. I focused on frontend.",
            "link": "https://www.youtube.com/watch?v=bwlGt4FDlcE",
            "linktype": "Youtube demo",
            "tags": [
                "Hackathon",
                "Javascript",
                "React.js",
                "Vite"
            ]
        },
        {
            "title": "AI Cover Letter Generator",
            "key": 1,
            "time": "July 2025",
            "description": "Developed a project that generates cover letters from LinkedIn application links and a given resume. Organizes responses into a folder as markdown files. Cover letters are generated by first scraping post details using Selenium, then using Google Gemini API with data to generate a personalized cover letter for each posting.",
            "link": "https://github.com/henovw/CVGenerator",
            "linktype": "GitHub repository",
            "tags": [
                "Python",
                "Selenium",
                "Google Gemini API"
            ]
        },
        {
            "title": "AI Interview Prepper",
            "key": 0,
            "time": "July 2025",
            "description": "Developed a website that generates 5 interview questions based on given information about the user and the job/company they're applying to. By entering information about the company, uploading your resume, and answering some questions it generates questions that are likely to be asked based on your resume and the company information.",
            "link": "https://github.com/henovw/InterviewPrepAI",
            "linktype": "Youtube demo",
            "tags": [
                "Python",
                "Django",
                "Google Gemini API"
            ]
        }
    ]
}